app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE "books"."availability" = 't'
---
  def index
    @books = Book.where(availability: true)

INSERT INTO "books" ("name", "author", "description", "price", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "resource_file_name", "resource_content_type", "resource_file_size", "resource_updated_at", "user_id", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create

    @book = current_user.books.new(book_params)
    @book.save

UPDATE "books" SET "availability" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["availability", "f"], ["updated_at", "2015-02-07 15:04:25.782959"], ["id", 5]]
---
  def update
    authorize! :manage, @book
    @book.update(book_params)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_book
      @book = Book.friendly.find(params[:id])