app/controllers/transactions_controller.rb

	def create
		book = Book.find_by!(slug: params[:slug])
		token = params[:stripeToken]

		begin
			charge = Stripe::Charge.create(
				amount: book.price,
				currency: "usd",
				card: token,
				description: current_user.email)
			@sale = book.sales.create!(
				buyer_email: current_user.email)
---
SELECT  "books".* FROM "books" WHERE "books"."slug" = ? LIMIT 1  [["slug", "ruby-on-rails-tutorial"]]
INSERT INTO "sales" ("amount", "buyer_email", "seller_email", "stripe_token", "book_id", "state", "created_at", "updated_at", "guid") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

	def pickup
		@sale = Sale.find_by!(guid: params[:guid])
---
SELECT  "sales".* FROM "sales" WHERE "sales"."guid" = ? LIMIT 1  [["guid", "ce6a911b-09cd-4dc2-8eee-fe794dbcdced"]]